x = float(input("請輸入數字:"))  # 輸入一個數字
if x > 1:  # 判斷是否大於1
    for i in range(2, int(x)):  # 從2開始到x-1進行迴圈
        if (x % i) == 0:  # 判斷x是否能被i整除
            print(f"{x}不是質數")  # 輸出不是質數
            break  # 結束迴圈
    else:  # 如果沒有被整除
        print(f"{x}是質數")  # 輸出是質數
else:  # 如果x小於等於1
    print(f"{x}不能是1or0")  # 輸出不是質數


# for...else
# 當for迴圈正常執行完畢後會執行else區塊
# 當for迴圈被break中斷時則不會執行else
# eaxmple:
for i in range(5):
    print(i)
else:
    print("迴圈結束")
    # while...else
# 當while迴圈正常執行完畢後會執行else區塊
# 當while迴圈被break中斷時則不會執行else
# eaxmple:
i = 0
while i < 5:
    print(i)
    i += 1
else:
    print("迴圈結束")

    # 這是第三次看else
    # else在...try...except...finally 也會出現，功能適當沒有發生例外時會執行else區塊的程式
    # else在...if...elif...else...

    # 倒數計時
import time

n = int(input("請輸入倒數秒數:"))
while n > 0:
    print(n)
    n -= 1
    time.sleep(1)
print("倒數結束")
print("時間到!")
# 倒數計時結束

# 迴圈的break可以用來跳出所屬的迴圈
# 所以判斷break🐭於哪個迴圈時，必須要注意縮排
# 例如：
for i in range(5):
    for j in range(5):
        if j == 2 and j == 2:
            break
        print(f"i={i},j={j}")
        # 這裡的break只會跳出內層的for迴圈
        # 外層的for迴圈仍會繼續執行


# 輸入要跳繩的次數
n = int(input("請輸入要跳繩的次數:"))
# 跳繩
for i in range(1, n + 1):
    if i % 10 == 0:
        print("休息一下")
        continue
    print("第" + str(i) + "次跳繩")
# continue
# 迴圈的 continue 可以用來跳過當前的迴圈，繼續執行下一次的迴圈
# 例如：
for i in range(5):
    if i == 2:
        continue
    print(i)

# 這裡的 continue 會跳過 i = 2 的那次迴圈，直接執行 i = 3 的那次迴圈
# 所以輸出的結果是 0, 1, 3, 4
# continue 也可以用在 while 迴圈中
# 例如：
i = 0
while i < 5:
    if i == 2:
        continue
    print(i)
    i += 1

# continue也要判斷所屬的迴圈，所以要注意縮排
